In [4]:
import pandas as pd
data = pd.read_csv('hp_data.csv')
print("Shape :", data.shape)
data.head()

Shape : (3500, 10)

,Unnamed: 0,price,place,built,sqft,sale,yearsOld,floor,totalFloor,bhk
0,1341,6300000,BTM Layout,Super built-up Area,1450,Resale,5,1,4,1
1,2126,11500000,Yelahanka,Super built-up Area,2190,Resale,5,3,5,3
2,816,3800000,Whitefield,Super built-up Area,1019,Resale,1,2,5,2
3,2708,10500000,Ambalipura,Super built-up Area,1857,Resale,15,4,5,4
4,1041,11500000,Yelahanka,Super built-up Area,2190,Resale,5,3,5,3

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3500 entries, 0 to 3499
Data columns (total 10 columns):
Unnamed: 0    3500 non-null int64
price         3500 non-null int64
place         3500 non-null object
built         3500 non-null object
sqft          3500 non-null int64
sale          3500 non-null object
yearsOld      3500 non-null int64
floor         3500 non-null int64
totalFloor    3500 non-null int64
bhk           3500 non-null int64
dtypes: int64(7), object(3)
memory usage: 273.5+ KB

In [16]:
#Label Encoding
from sklearn.preprocessing import LabelEncoder
enc = LabelEncoder()
data.place = enc.fit_transform(data.place)

In [17]:
enc.classes_

array(['Abbaiah Reddy Layout', 'Ambalipura', 'BTM Layout',
       'Devarabeesana Halli', 'Electronics City Phase 1', 'Frazer Town',
       'Gunjur', 'KR Puram', 'Malleshwaram', 'Rajaji Nagar',
       'Sarakki Nagar', 'Subramanyapura', 'Whitefield', 'Yelachenahalli',
       'Yelahanka'], dtype=object)

In [18]:
data.head()

,Unnamed: 0,price,place,built,sqft,sale,yearsOld,floor,totalFloor,bhk
0,1341,6300000,2,Super built-up Area,1450,Resale,5,1,4,1
1,2126,11500000,14,Super built-up Area,2190,Resale,5,3,5,3
2,816,3800000,12,Super built-up Area,1019,Resale,1,2,5,2
3,2708,10500000,1,Super built-up Area,1857,Resale,15,4,5,4
4,1041,11500000,14,Super built-up Area,2190,Resale,5,3,5,3

In [19]:
X = data.loc[:,['sqft','yearsOld','place','floor','bhk']]
y = data.price
X.head(2)

   sqft  yearsOld  place  floor  bhk
0  1450         5      2      1    1
1  2190         5     14      3    3

In [10]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()
model.fit(X,y)
model.predict([[1600,1,210,3]])

array([ 8296522.07919929])